nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso860max/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: LPC865
package_id: LPC865M201JBD64
mcu_data: ksdk2_0
processor_version: 0.15.6
board: LPCXpresso860MAX
pin_labels:
- {pin_num: '1', pin_signal: PIO1_8, label: 'P3[37]/P1_8-SPI2_MISO'}
- {pin_num: '2', pin_signal: PIO0_13/ADC_10, label: P0_13-CUR_DCB}
- {pin_num: '3', pin_signal: PIO1_9, label: 'P3[36]/P1_9-SPI2_SCK'}
- {pin_num: '4', pin_signal: PIO0_12, label: D1/SW1/P0_12-RED-ISP, identifier: SW1;LED_RED}
- {pin_num: '5', pin_signal: RESET/PIO0_5, label: 'SW3/J5[6]/P3[4]/U4[3]/TARGET_nRESET-P0_5', identifier: DEBUG_SWD_RESETN}
- {pin_num: '6', pin_signal: PIO0_4/ADC_11, label: 'SW2/P3[35]/P0_4-WAKEUP', identifier: SW2}
- {pin_num: '7', pin_signal: VDD7, label: 'JP2[1]/C10/C11/C2/VDD'}
- {pin_num: '8', pin_signal: VSS8, label: GND}
- {pin_num: '9', pin_signal: PIO1_12, label: D2/P1_12-GREEN, identifier: LED_GREEN}
- {pin_num: '10', pin_signal: PIO0_28/WKTCLKIN, label: D3/P0_28-BLUE, identifier: LED_BLUE}
- {pin_num: '11', pin_signal: PIO1_13, label: 'P1_13-SPI1_MOSI/P3[5]'}
- {pin_num: '12', pin_signal: SWCLK/PIO0_3, label: 'TARGET_SWCLK/J7[4]', identifier: DEBUG_SWD_SWCLK}
- {pin_num: '13', pin_signal: PIO0_31, label: 'P0_31-ENC_I/J2[3]'}
- {pin_num: '14', pin_signal: SWDIO/PIO0_2, label: 'TARGET_SWDIO/J7[2]', identifier: DEBUG_SWD_SWDIO}
- {pin_num: '15', pin_signal: PIO1_0, label: P1_0-SPI1_MISO}
- {pin_num: '16', pin_signal: PIO0_11, label: 'P0_11-I2C0_SDA/P3[40]/J1[18]/J3[7]'}
- {pin_num: '17', pin_signal: PIO0_10, label: 'P0_10-I2C0_SCL/P3[41]/J1[20]/J3[5]'}
- {pin_num: '18', pin_signal: PIO1_1, label: 'P1_1-PWM_CB/J5[5]'}
- {pin_num: '19', pin_signal: PIO0_16, label: 'P0_16-PWM_CT/J5[7]'}
- {pin_num: '20', pin_signal: PIO1_2, label: 'P1_2-PWM_BB/J5[9]'}
- {pin_num: '21', pin_signal: PIO0_27, label: 'P0_27-PWM_BT/J5[11]'}
- {pin_num: '22', pin_signal: PIO1_14, label: 'P1_14-I3C0_SCL/J1[4]/P3[9]/U5[13]'}
- {pin_num: '23', pin_signal: PIO0_26, label: 'P0_26-I3C0_SDA/J1[2]/P3[10]/U5[14]'}
- {pin_num: '24', pin_signal: PIO1_15, label: 'P1_15-I3C0_PUR/J1[16]/P3[11]/'}
- {pin_num: '25', pin_signal: VSS25, label: GND}
- {pin_num: '26', pin_signal: VDD26, label: 'JP2[1]/C10/C11/C2/VDD'}
- {pin_num: '27', pin_signal: PIO0_25, label: 'P3[21]/J2[4]/P0_25-ISP_U_TXD'}
- {pin_num: '28', pin_signal: PIO0_24, label: 'P3[22]/J2[2]/P0_24-ISP_U_RXD'}
- {pin_num: '29', pin_signal: PIO1_3, label: 'P3[7]/P1_3-SPI1_SCK'}
- {pin_num: '30', pin_signal: PIO0_15, label: 'P3[8]/P0_15-SPI1_SSEL'}
- {pin_num: '31', pin_signal: PIO1_4, label: 'J3[1]/P3[24]/P1_4'}
- {pin_num: '32', pin_signal: PIO0_1/ACMP_I2/CLKIN, label: 'J3[3]/P3[25]/P0_1'}
- {pin_num: '33', pin_signal: PIO0_9/XTALOUT, label: 'P3[27]/PIO0_8/XTALIN'}
- {pin_num: '34', pin_signal: PIO0_8/XTALIN, label: 'P3[26]/PIO0_9/XTALOUT'}
- {pin_num: '35', pin_signal: PIO1_5, label: 'J5[13]/P1_5-PWM_AB'}
- {pin_num: '38', pin_signal: PIO1_6, label: 'J5[15]/P1_6-PWM_AT'}
- {pin_num: '36', pin_signal: PIO1_16, label: 'P3[14]/P1_16-TARGET_RX_DEBUG', identifier: DEBUG_UART_RX}
- {pin_num: '37', pin_signal: PIO1_17, label: 'P3[13]/P1_17-TARGET_TX_DEBUG', identifier: DEBUG_UART_TX}
- {pin_num: '39', pin_signal: VDD39, label: 'JP2[1]/C10/C11/C2/VDD'}
- {pin_num: '40', pin_signal: VSS40, label: GND}
- {pin_num: '41', pin_signal: VREFN, label: C14/C25/VREFN}
- {pin_num: '42', pin_signal: VREFP, label: C14/C25/FB7/VREFP}
- {pin_num: '43', pin_signal: PIO1_18, label: 'J3[8]/P3[53/P1_18-SPI_SCK'}
- {pin_num: '44', pin_signal: PIO1_19, label: 'J3[6]/P3[52]/P1_19-SPI_MISO'}
- {pin_num: '45', pin_signal: PIO0_7/ADC_0, label: 'J6[12]/P3[20]/PIO0_7/ADC_0'}
- {pin_num: '48', pin_signal: PIO0_0/ACMP_I1, label: 'J3[2]/P3[50]/P0_0-SPI_SSE'}
- {pin_num: '47', pin_signal: PIO1_7, label: 'J3[4]/P3[51]/P1_7-SPI_MOSI'}
- {pin_num: '46', pin_signal: PIO0_6/ADC_1/ACMPVREF, label: 'J6[10]/P3[19]/PIO0_6-ADC_1-ACMPVREF'}
- {pin_num: '49', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: 'P3[18]/J6[8]/PIO0_14-ADC_2-ACMP_I3'}
- {pin_num: '50', pin_signal: PIO0_29, label: 'J5[3]/P0_29-ENC_A'}
- {pin_num: '54', pin_signal: PIO0_30/ACMP_I5, label: 'J5[1]/P0_30-ENC_B'}
- {pin_num: '51', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: 'P3[17]/J6[6]/PIO0_23-ADC_3-ACMP_I4'}
- {pin_num: '52', pin_signal: VDDA, label: C17/FB6/VDDA}
- {pin_num: '53', pin_signal: VSSA, label: GND}
- {pin_num: '55', pin_signal: PIO0_22/ADC_4, label: 'J6[4]/J2[10]/P3[16]/P3[47]/PIO0_22/ADC_4'}
- {pin_num: '56', pin_signal: PIO1_20, label: 'J2[6]/P3[49]/P1_20-INT1'}
- {pin_num: '57', pin_signal: PIO0_21/ADC_5, label: 'J6[2]/J2[12]/P3[15]/P3[46]/PIO0_21/ADC_5'}
- {pin_num: '58', pin_signal: PIO0_20/ADC_6, label: 'J1[1]/J2[14/P3[45/P0_20-BEMF_A'}
- {pin_num: '60', pin_signal: PIO0_19/ADC_7, label: 'J1[3]/J2[16]/P3[44]/P0_19-BEMF_B'}
- {pin_num: '59', pin_signal: PIO1_21, label: 'J2[8]/P3[48]/P1_21-INT0'}
- {pin_num: '61', pin_signal: PIO0_18/ADC_8, label: 'J1[5]/J1[6]/P3[43]/P0_18-BEMF_C'}
- {pin_num: '62', pin_signal: PIO1_11, label: 'P3[39]/P1_11'}
- {pin_num: '63', pin_signal: PIO0_17/ADC_9, label: 'J1[7]/J1[8]/P3[42]/P0_17-VOLT_DCB'}
- {pin_num: '64', pin_signal: PIO1_10, label: 'P3{38]/P1_10'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

